public class Card_list {
    int[] cardlist=new int[100];
    public void all_cardlist() {
        cardlist[1]=1;
        //[공격1] 타격1 .피해를 10준다
        cardlist[2]=2;
        //[수비1] 수비 .방어도 8증가
        cardlist[3]=3;
        //[공격1] 강타. 전체 적에게 8만큼 피해를 준다.
        cardlist[4]=4;
        //[공격0] 격돌. 손에 있는 카드가 모두 공격카드 일때 데미지 14 넣어줌
        cardlist[5]=5;
        //[공격1]혈류. 체력을 2 잃고 피해를 15 준다.
        cardlist[6]=6;
        //[공격1]몸통박치기. 현재 방어도만큼의 피해를 준다.
        cardlist[7]=7;
        //[공격2]어퍼컷. 약화를 2 부여하고 피해를 12 줍니다.
        cardlist[8]=8;
        //[스킬0]위압. 적 전체에게 약화를 1 부여한다.
        cardlist[9]=9;
        //[스킬0]격노. 이번 턴에 데미지를 줄 때마다 방어도가 3씩 증가한다.
        cardlist[10]=10;
        //[스킬0] 진정한 끈기. 방어도를 7얻습니다. 무작위로 패 한장을 버립니다.

    }



}
