public class Story {
    public void story(){
        System.out.println("+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-++-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+");
        System.out.println("엘라라는 신비한 땅에 무서운 거인 \'골리앗\'이 이끄는 \'블레셋족\'들이 있었습니다.");
        System.out.println("\'블레셋족\'은 엘라의 또 다른 백성들인 \'이스라엘 백성\'들이 엘라에 도움이 되지 못한다고 생각했습니다. ");
        System.out.println("그 결과 \'블레셋족\'들과 \'이스라엘 백성\' 사이에 갈등이 빚어졌고 결국 \'블레셋\'쪽에서 전쟁 선포를 하게 되었습니다.");
        System.out.println();
        System.out.println("하지만, 이스라엘 백성은 \'거인 골리앗\'이 이끄는 \'블레셋족\'들의 거대한 몸집과 힘 때문에 곤경에 처해 있습니다.");
        System.out.println("모두가 겁을 먹고 있던 그 때 \'다윗\'이라는 젊고 대담한 양치기 소년이 우똑 솟은 위협에 맞서기로 결심하고 앞으로 나섭니다.");
        System.out.println();
        System.out.println("아침 해가 전장에 금빛 빛을 드리울 때, \'블레셋 대군\'이 건너편 넓은 들판에 모입니다.");
        System.out.println("당당한 갑옷을 입고 거대한 검을 휘두르는 \'골리앗\'이 블레셋 군대의 후미에 서 있습니다.");
        System.out.println("반대편에는 부드러운 가죽갑옷으로 무장한 \'다윗\'이 \'이스라엘 사람\'의 예상치 못한 챔피언으로 서 있습니다.\n");
        System.out.println();
        System.out.println("그 신비한 땅 엘라에서 오래된 전투가 곧 펼쳐질 예정입니다. . . . .");
        System.out.println("+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-++-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n\n\n\n\n");
    }


}
